app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "fname1"], ["last_name", "lname"], ["created_at", "2021-03-29 23:24:01.589816"], ["updated_at", "2021-03-29 23:24:01.589816"]]
---
    def create
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))